# Stat
import dataset from https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv

In [1]:
import pandas as pd

In [29]:
df = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")

In [32]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

#### Delete the column 'Unnamed: 0' and 'Id'

In [34]:
df = df.drop(["Unnamed: 0", "Id"], axis=1)
df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

#### Are there more male or female names in the dataset?

In [35]:
df["Gender"].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

#### Group the dataset by name and assign to names

In [38]:
df = df.drop(["Year"], axis =1)
df.head()

      Name State  Count
0     Emma    AK     62
1  Madison    AK     48
2   Hannah    AK     46
3    Grace    AK     44
4    Emily    AK     41

In [40]:
name = df.groupby("Name").sum()
name.head()
name.sort_values("Count", ascending = 0).head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

In [41]:
name.sort_values("Count", ascending = 1).head()

          Count
Name
Destenie      5
Janisha       5
Lizvet        5
Arsalan       5
Janira        5

#### How many different names exist in the dataset?

In [42]:
len(name)

17632

#### What is the name with most occurrences?

In [43]:
name.Count.idxmax()

'Jacob'

####  How many different names have the least occurrences?

In [44]:
len(name[name.Count == name.Count.min()])

2578

#### What is the median name occurrence?

In [45]:
name[name.Count == name.Count.median()]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

#### What is the standard deviation of names?

In [46]:
name.Count.std()

11006.069467891111

In [48]:
name.Count.median()

49.0

#### Get a summary with the mean, min, max, std and quartiles

In [49]:
name.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000